In [1]:
import pandas as pd
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [2]:
import numpy as np
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                  columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
df = pd.DataFrame({
   'name': ['alpha', 'apple', 'arsenic', 'angel', 'android'],
   'num': [1, 2, 3, 4, 5],
   'fruit': ['coconut', 'curse', 'cassava', 'cuckoo', 'clarinet'],
   'num2': [6, 7, 8, 9, 10]
   }, index=['row_0', 'row_2', 'row_1', 'row_3', 'row_4'])
df

          name  num     fruit  num2
row_0    alpha    1   coconut     6
row_2    apple    2     curse     7
row_1  arsenic    3   cassava     8
row_3    angel    4    cuckoo     9
row_4  android    5  clarinet    10

In [15]:
print(df.loc['row_2'])

name     apple
num          2
fruit    curse
num2         7
Name: row_2, dtype: object

In [19]:
print(df.iloc[0:3])

          name  num    fruit  num2
row_0    alpha    1  coconut     6
row_2    apple    2    curse     7
row_1  arsenic    3  cassava     8

In [20]:
print(df['name'])

row_0      alpha
row_2      apple
row_1    arsenic
row_3      angel
row_4    android
Name: name, dtype: object

In [26]:
print(df['name'])

row_0      alpha
row_2      apple
row_1    arsenic
row_3      angel
row_4    android
Name: name, dtype: object

In [27]:
print(df.name)

row_0      alpha
row_2      apple
row_1    arsenic
row_3      angel
row_4    android
Name: name, dtype: object

In [35]:
print(df.iloc[[2, 4], 0:3])

          name  num     fruit
row_1  arsenic    3   cassava
row_4  android    5  clarinet

In [37]:
# This is most convenient for VIEWING: 
print(df.iloc[0:3][['name','num']])

# But this is best practice/more stable for assignment/manipulation:
print(df.loc[df.index[0:3], 'name'])

          name  num
row_0    alpha    1
row_2    apple    2
row_1  arsenic    3
row_0      alpha
row_2      apple
row_1    arsenic
Name: name, dtype: object